import { Film } from "../types";

export const DEFAULT_FILMS: Film[] = [
  {
    "id": "f1d0728c-6ef6-4be7-ae86-0498a4da4d51",
    "title": "Начало",
    "description": "Кобб — талантливый вор, лучший в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна.",
    "rating": 8.7,
    "year": 2010,
    "genres": "Фантастика, Боевик, Триллер",
    "tags": "сон, подсознание, команда, нолан"
  },
  {
    "id": "f2d0728c-6ef6-4be7-ae86-0498a4da4d52",
    "title": "Интерстеллар",
    "description": "Когда засуха, пыльные бури и вымирание растений приводят человечество к продовольственному кризису, группа исследователей отправляется в путешествие сквозь червоточину.",
    "rating": 8.6,
    "year": 2014,
    "genres": "Фантастика, Драма",
    "tags": "космос, время, вселенная, отец, дочь, нолан"
  },
  {
    "id": "f3d0728c-6ef6-4be7-ae86-0498a4da4d53",
    "title": "1+1 (Неприкасаемые)",
    "description": "Пострадав в результате несчастного случая, богатый аристократ Филипп нанимает в качестве помощника человека, который менее всего подходит для этой работы.",
    "rating": 8.8,
    "year": 2011,
    "genres": "Драма, Комедия",
    "tags": "дружба, юмор, жизнь, франция"
  },
  {
    "id": "f4d0728c-6ef6-4be7-ae86-0498a4da4d54",
    "title": "Унесённые призраками",
    "description": "Маленькая Тихиро вместе с мамой и папой переезжают в новый дом. Заблудившись по дороге, они оказываются в странном пустынном городе.",
    "rating": 8.5,
    "year": 2001,
    "genres": "Мультфильм, Фэнтези, Семейный",
    "tags": "аниме, миядзаки, духи, магия, приключения"
  },
  {
    "id": "f5d0728c-6ef6-4be7-ae86-0498a4da4d55",
    "title": "Шрэк",
    "description": "Жил-был в зеленом болоте свирепый великан-людоед по имени Шрэк. Но однажды его покой нарушили сказочные персонажи, изгнанные лордом Фаркуадом.",
    "rating": 8.1,
    "year": 2001,
    "genres": "Мультфильм, Комедия, Фэнтези, Семейный",
    "tags": "огр, осел, принцесса, юмор, болото"
  },
  {
    "id": "f6d0728c-6ef6-4be7-ae86-0498a4da4d56",
    "title": "Остров проклятых",
    "description": "Два судебных пристава отправляются на один из островов в штате Массачусетс, чтобы расследовать исчезновение пациентки клиники для умалишенных.",
    "rating": 8.5,
    "year": 2010,
    "genres": "Триллер, Драма, Детектив",
    "tags": "остров, клиника, расследование, дикаприо"
  }
];
